In [1]:
import pandas as pd

In [2]:
s = pd.Series([3,4,5],['earth','mars','jupiter'])
k = pd.Series([1,2,3],['earth','mars','jupiter']) 
#Create DataFrame df from two series
df = pd.DataFrame({'mass':s,'diameter':k})

In [3]:
df.head()

         mass  diameter
earth       3         1
mars        4         2
jupiter     5         3

In [4]:
newdf = df

In [6]:
newdf = newdf.drop('mass', axis=1)

In [7]:
newdf.head()

         diameter
earth           1
mars            2
jupiter         3

In [8]:
df.head()

         mass  diameter
earth       3         1
mars        4         2
jupiter     5         3